/**
 * @file    App_Types.h
 * @brief   从机系统全局数据结构、联合体定义及外部全局变量声明
 */

#ifndef __APP_TYPES_H__
#define __APP_TYPES_H__

#include "stdint.h"
#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"

// ==============================================================================================================================
// 全局状态与数据相关的类型定义
// ==============================================================================================================================

// ==========================================
// 1. 底盘两轮速度结构体
// ==========================================
typedef struct {
    int16_t speed_1; // 左轮电机速度
    int16_t speed_2; // 右轮电机速度
} Car_Speed_t;

// ==========================================
// 2. 全局变量的外部声明 (Extern)
// ==========================================
// 暴露给其他文件使用的全局速度变量
extern Car_Speed_t current_car_speed;
// 暴露给其他文件使用的全局电量变量
extern uint8_t current_power_percentage;


// ==============================================================================================================================
// CAN通信 相关的类型定义
// ==============================================================================================================================

// ==========================================
// 1. 定义 CAN 通信 ID
// ==========================================
#define CAN_ID_SLAVE_SPEED   0x201  // 从机上报：4个速度
#define CAN_ID_SLAVE_POWER   0x202  // 从机上报：电池电量
#define CAN_ID_HOST_LED      0x101  // 主机下发：LED 控制指令

// ==========================================
// 2. 速度上报共用体 (占用 4 字节)
// ==========================================
typedef union {
    int16_t speeds[2]; // speed[0]和[1]分别对应电机1和2 (左右轮)
    uint8_t bytes[4];
} CAN_SpeedPayload_t;

// ==========================================
// 3. LED 控制共用体 (占用 3 字节)
// ==========================================
typedef union {
    struct {
        uint8_t led1;
        uint8_t led2;
        uint8_t led3;
    } leds;
    uint8_t bytes[3];
} CAN_LEDPayload_t;








#endif // __APP_TYPES_H_
